```hcl
08:20:11.429 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./s3
- Unit ./vpc

Group 2
- Unit ./eks



Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.vpcs["medvista-runner"].aws_vpc.this[0]: Refreshing state... [id=vpc-068832b2aaef968e4]
module.vpcs["medvista-runner"].aws_default_security_group.this[0]: Refreshing state... [id=sg-072c58a5038a7c309]
module.vpcs["medvista-runner"].aws_default_route_table.default[0]: Refreshing state... [id=rtb-09479e728471dc776]
module.vpcs["medvista-runner"].aws_default_network_acl.this[0]: Refreshing state... [id=acl-007a1d04b8e8965bc]
module.vpcs["medvista-runner"].aws_route_table.private[0]: Refreshing state... [id=rtb-0fe4fd03f4991d058]
module.vpcs["medvista-runner"].aws_route_table.public[0]: Refreshing state... [id=rtb-074e383b1e8052219]
module.vpcs["medvista-runner"].aws_subnet.public[0]: Refreshing state... [id=subnet-0c6275b6bebc113ac]
module.vpcs["medvista-runner"].aws_subnet.public[1]: Refreshing state... [id=subnet-0eb1cbc30c299b269]
module.vpcs["medvista-runner"].aws_subnet.private[1]: Refreshing state... [id=subnet-0c62b4a8241fa4f0c]
module.vpcs["medvista-runner"].aws_subnet.private[0]: Refreshing state... [id=subnet-0a421cb1ae52b1316]
module.vpcs["medvista-runner"].aws_internet_gateway.this[0]: Refreshing state... [id=igw-06f6debb07a269ec1]
module.vpcs["medvista-runner"].aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-074e383b1e80522191080289494]
module.vpcs["medvista-runner"].aws_eip.nat[0]: Refreshing state... [id=eipalloc-02a56d4a1991b7687]
module.vpcs["medvista-runner"].aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01ca636eb503e7f19]
module.vpcs["medvista-runner"].aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06a8035a17c669b3e]
module.vpcs["medvista-runner"].aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e8812dcbf26a61c]
module.vpcs["medvista-runner"].aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9da1df4d55b5a59]
module.vpcs["medvista-runner"].aws_nat_gateway.this[0]: Refreshing state... [id=nat-056c71dfbc74199b8]
module.vpcs["medvista-runner"].aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0fe4fd03f4991d0581080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_caller_identity.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_partition.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.medvista_runner.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.medvista_runner.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.medvista_runner.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/medvista-runner/cluster]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_partition.current: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.medvista_runner.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.medvista_runner.module.eks.data.aws_partition.current[0]: Reading...
module.medvista_runner.module.eks.data.aws_caller_identity.current[0]: Reading...
module.medvista_runner.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-047055e8ea6145b57]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role.this[0]: Refreshing state... [id=runner-eks-node-group-20260108101112872100000004]
module.medvista_runner.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.aws_iam_role.this[0]: Refreshing state... [id=medvista-runner-cluster-20260108101112870500000001]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20260108101112874400000006]
module.medvista_runner.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c0c2cd831afb2ac2]
module.medvista_runner.module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.medvista_runner.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=medvista-runner-cluster-20260108101112870500000001-2026010810111391920000000b]
module.medvista_runner.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.medvista_runner.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=medvista-runner-cluster-20260108101112870500000001-2026010810111393900000000d]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.additional["policy_arn"]: Refreshing state... [id=runner-eks-node-group-20260108101112872100000004-2026010810111407200000000f]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.additional["policy_arn"]: Refreshing state... [id=general-eks-node-group-20260108101112874400000006-20260108101113796100000008]
module.medvista_runner.module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/medvista-runner-cluster-20260108101112870600000002]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=medvista-runner-cluster-20260108101112870500000001-2026010810111392740000000c]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=runner-eks-node-group-20260108101112872100000004-20260108101114180100000011]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20260108101112874400000006-2026010810111388000000000a]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=runner-eks-node-group-20260108101112872100000004-2026010810111405490000000e]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20260108101112874400000006-20260108101113737500000007]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=runner-eks-node-group-20260108101112872100000004-20260108101114085000000010]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20260108101112874400000006-20260108101113814200000009]
module.medvista_runner.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=587210147621]
module.medvista_runner.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.medvista_runner.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::587210147621:user/terraform]
module.medvista_runner.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.medvista_runner.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3118601999]
module.medvista_runner.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1e8a1cf5-6afa-45cb-b67f-a9e3ea97dc47]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3105632051]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4014355476]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1665356415]
module.medvista_runner.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-750936334]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3451647893]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1259968507]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2858242598]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3724294659]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2852206057]
module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3109882312]
module.medvista_runner.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-734846221]
module.medvista_runner.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/medvista-runner]
module.medvista_runner.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/medvista-runner-cluster-ClusterEncryption20260108101141257200000012]
module.medvista_runner.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=medvista-runner-cluster-20260108101112870500000001-20260108101141825400000013]
module.medvista_runner.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=medvista-runner]
module.medvista_runner.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=medvista-runner:arn:aws:iam::587210147621:user/terraform]
module.medvista_runner.module.eks.time_sleep.this[0]: Refreshing state... [id=2026-01-08T10:21:40Z]
module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-00397a7228871b73f,Owner]
module.medvista_runner.module.eks.data.tls_certificate.this[0]: Reading...
module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-00397a7228871b73f,Project]
module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Created_By"]: Refreshing state... [id=sg-00397a7228871b73f,Created_By]
module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Contacts"]: Refreshing state... [id=sg-00397a7228871b73f,Contacts]
module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-00397a7228871b73f,Environment]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1813499983764144534]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=513534612823784043]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_launch_template.this[0]: Refreshing state... [id=lt-0cea89bf87ac8bc20]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0391785eac7ac0a50]
module.medvista_runner.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=medvista-runner#arn:aws:iam::587210147621:user/terraform#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=medvista-runner:general-20260108102149006500000018]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_eks_node_group.this[0]: Refreshing state... [id=medvista-runner:runner-2026010810214900700000001a]
module.medvista_runner.module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=2efe2bc0b862928b4aefe315c4a10c4ad5223ff5]
module.medvista_runner.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::587210147621:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/480D1158911E0C1653F3C13DAA125E6B]
module.medvista_runner.kubernetes_service_account.k8s_service_account: Refreshing state... [id=kube-system/devops-admin]
module.medvista_runner.kubernetes_cluster_role_binding.k8s_role_binding: Refreshing state... [id=devops-admin]
module.medvista_runner.kubernetes_secret.k8s_secret: Refreshing state... [id=kube-system/devops-admin]
module.medvista_runner.data.kubernetes_secret.k8s_secret_data: Reading...
module.medvista_runner.data.kubernetes_secret.k8s_secret_data: Read complete after 0s [id=kube-system/devops-admin]
module.medvista_runner.local_file.kubeconfig: Refreshing state... [id=cef6468e31a38be33f4ed54bf2c348d2bfec0bd9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.medvista_runner.local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/runner/work/Infrastructure/Infrastructure/terraform/medvista-aws-ap-south-1/eks/kubeconfigs/devops-admin-medvista-runner-kubeconfig.yaml"
      + id                   = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "medvista-runner:runner-2026010810214900700000001a"
        tags                   = {
            "Contacts"    = "pranat.pattankude@corazoncare.com"
            "Created_By"  = "Terraform"
            "Environment" = "Runners"
            "Name"        = "runner"
            "Owner"       = "terraform"
            "Project"     = "Medvista"
        }
        # (16 unchanged attributes hidden)

      ~ scaling_config {
          ~ max_size     = 2 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.medvista_runner.kubernetes_service_account.k8s_service_account,
  on ../modules/runner-eks-with-kubeconfig/main.tf line 35, in resource "kubernetes_service_account" "k8s_service_account":
  35: resource "kubernetes_service_account" "k8s_service_account" {

Deprecated; use kubernetes_service_account_v1.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"
```

<!-- thollander/actions-comment-pull-request "file" -->